[Killed] StringLiteral
src/redact.mjs:7:25
 import { createHash } from "node:crypto";
 import { homedir, userInfo } from "node:os";
 
-export const REDACTED = "[redacted]";
+export const REDACTED = "";
 
 // Superset of the standout regex list, plus env-style assignments, ssh keys,
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 197.441081

[Survived] Regex
src/redact.mjs:12:3
 // Superset of the standout regex list, plus env-style assignments, ssh keys,
 // hex secrets, connection-string passwords, and cloud tokens.
 const SECRET_PATTERNS = [
-  /-----BEGIN[A-Z ]*PRIVATE KEY-----[\s\S]*?-----END[A-Z ]*PRIVATE KEY-----/g,
+  /-----BEGIN[A-Z ]*PRIVATE KEY-----[\s\S]*?-----END[A-Z ]PRIVATE KEY-----/g,
   /ssh-(?:rsa|ed25519|dss|ecdsa)\s+[A-Za-z0-9+/=]{40,}/g,
   /sk-ant-[A-Za-z0-9_-]{20,}/g,

[Survived] Regex
src/redact.mjs:12:3
 // Superset of the standout regex list, plus env-style assignments, ssh keys,
 // hex secrets, connection-string passwords, and cloud tokens.
 const SECRET_PATTERNS = [
-  /-----BEGIN[A-Z ]*PRIVATE KEY-----[\s\S]*?-----END[A-Z ]*PRIVATE KEY-----/g,
+  /-----BEGIN[A-Z ]*PRIVATE KEY-----[\s\S]-----END[A-Z ]*PRIVATE KEY-----/g,
   /ssh-(?:rsa|ed25519|dss|ecdsa)\s+[A-Za-z0-9+/=]{40,}/g,
   /sk-ant-[A-Za-z0-9_-]{20,}/g,

[Survived] Regex
src/redact.mjs:13:3
 // hex secrets, connection-string passwords, and cloud tokens.
 const SECRET_PATTERNS = [
   /-----BEGIN[A-Z ]*PRIVATE KEY-----[\s\S]*?-----END[A-Z ]*PRIVATE KEY-----/g,
-  /ssh-(?:rsa|ed25519|dss|ecdsa)\s+[A-Za-z0-9+/=]{40,}/g,
+  /ssh-(?:rsa|ed25519|dss|ecdsa)\s+[^A-Za-z0-9+/=]{40,}/g,
   /sk-ant-[A-Za-z0-9_-]{20,}/g,
   /sk-(?:proj-|live-|test-)?[A-Za-z0-9_-]{20,}/g,

[Survived] Regex
src/redact.mjs:13:3
 // hex secrets, connection-string passwords, and cloud tokens.
 const SECRET_PATTERNS = [
   /-----BEGIN[A-Z ]*PRIVATE KEY-----[\s\S]*?-----END[A-Z ]*PRIVATE KEY-----/g,
-  /ssh-(?:rsa|ed25519|dss|ecdsa)\s+[A-Za-z0-9+/=]{40,}/g,
+  /ssh-(?:rsa|ed25519|dss|ecdsa)\s+[A-Za-z0-9+/=]/g,
   /sk-ant-[A-Za-z0-9_-]{20,}/g,
   /sk-(?:proj-|live-|test-)?[A-Za-z0-9_-]{20,}/g,

[Survived] Regex
src/redact.mjs:14:3
 const SECRET_PATTERNS = [
   /-----BEGIN[A-Z ]*PRIVATE KEY-----[\s\S]*?-----END[A-Z ]*PRIVATE KEY-----/g,
   /ssh-(?:rsa|ed25519|dss|ecdsa)\s+[A-Za-z0-9+/=]{40,}/g,
-  /sk-ant-[A-Za-z0-9_-]{20,}/g,
+  /sk-ant-[A-Za-z0-9_-]/g,
   /sk-(?:proj-|live-|test-)?[A-Za-z0-9_-]{20,}/g,
   /npm_[A-Za-z0-9]{36}/g,

[Survived] Regex
src/redact.mjs:15:3
   /-----BEGIN[A-Z ]*PRIVATE KEY-----[\s\S]*?-----END[A-Z ]*PRIVATE KEY-----/g,
   /ssh-(?:rsa|ed25519|dss|ecdsa)\s+[A-Za-z0-9+/=]{40,}/g,
   /sk-ant-[A-Za-z0-9_-]{20,}/g,
-  /sk-(?:proj-|live-|test-)?[A-Za-z0-9_-]{20,}/g,
+  /sk-(?:proj-|live-|test-)[A-Za-z0-9_-]{20,}/g,
   /npm_[A-Za-z0-9]{36}/g,
   /gh[pousr]_[A-Za-z0-9]{36,}/g,

[Killed] Regex
src/redact.mjs:17:3
   /sk-ant-[A-Za-z0-9_-]{20,}/g,
   /sk-(?:proj-|live-|test-)?[A-Za-z0-9_-]{20,}/g,
   /npm_[A-Za-z0-9]{36}/g,
-  /gh[pousr]_[A-Za-z0-9]{36,}/g,
+  /gh[^pousr]_[A-Za-z0-9]{36,}/g,
   /github_pat_[A-Za-z0-9_]{60,}/g,
   /glpat-[A-Za-z0-9_-]{20,}/g,
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 52.112874

[Killed] Regex
src/redact.mjs:17:3
   /sk-ant-[A-Za-z0-9_-]{20,}/g,
   /sk-(?:proj-|live-|test-)?[A-Za-z0-9_-]{20,}/g,
   /npm_[A-Za-z0-9]{36}/g,
-  /gh[pousr]_[A-Za-z0-9]{36,}/g,
+  /gh[pousr]_[^A-Za-z0-9]{36,}/g,
   /github_pat_[A-Za-z0-9_]{60,}/g,
   /glpat-[A-Za-z0-9_-]{20,}/g,
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 545.625805

[Survived] Regex
src/redact.mjs:18:3
   /sk-(?:proj-|live-|test-)?[A-Za-z0-9_-]{20,}/g,
   /npm_[A-Za-z0-9]{36}/g,
   /gh[pousr]_[A-Za-z0-9]{36,}/g,
-  /github_pat_[A-Za-z0-9_]{60,}/g,
+  /github_pat_[^A-Za-z0-9_]{60,}/g,
   /glpat-[A-Za-z0-9_-]{20,}/g,
   /AKIA[0-9A-Z]{16}/g,

[Survived] Regex
src/redact.mjs:19:3
   /npm_[A-Za-z0-9]{36}/g,
   /gh[pousr]_[A-Za-z0-9]{36,}/g,
   /github_pat_[A-Za-z0-9_]{60,}/g,
-  /glpat-[A-Za-z0-9_-]{20,}/g,
+  /glpat-[^A-Za-z0-9_-]{20,}/g,
   /AKIA[0-9A-Z]{16}/g,
   /ASIA[0-9A-Z]{16}/g,

[Survived] Regex
src/redact.mjs:21:3
   /github_pat_[A-Za-z0-9_]{60,}/g,
   /glpat-[A-Za-z0-9_-]{20,}/g,
   /AKIA[0-9A-Z]{16}/g,
-  /ASIA[0-9A-Z]{16}/g,
+  /ASIA[^0-9A-Z]{16}/g,
   /AIza[0-9A-Za-z_-]{35}/g,
   /ya29\.[A-Za-z0-9_-]{20,}/g,

[Survived] Regex
src/redact.mjs:22:3
   /glpat-[A-Za-z0-9_-]{20,}/g,
   /AKIA[0-9A-Z]{16}/g,
   /ASIA[0-9A-Z]{16}/g,
-  /AIza[0-9A-Za-z_-]{35}/g,
+  /AIza[0-9A-Za-z_-]/g,
   /ya29\.[A-Za-z0-9_-]{20,}/g,
   /xox[baprs]-[A-Za-z0-9-]{10,}/g,

[Survived] Regex
src/redact.mjs:26:3
   /ya29\.[A-Za-z0-9_-]{20,}/g,
   /xox[baprs]-[A-Za-z0-9-]{10,}/g,
   /[rs]k_(?:live|test)_[A-Za-z0-9]{20,}/g,
-  /eyJ[A-Za-z0-9_-]{10,}\.eyJ[A-Za-z0-9_-]{10,}\.[A-Za-z0-9_-]{6,}/g, // JWT
+  /eyJ[^A-Za-z0-9_-]{10,}\.eyJ[A-Za-z0-9_-]{10,}\.[A-Za-z0-9_-]{6,}/g, // JWT
   /dg_[A-Za-z0-9]{30,}/g, // Deepgram
   /hf_[A-Za-z0-9]{30,}/g, // HuggingFace

[Survived] Regex
src/redact.mjs:26:3
   /ya29\.[A-Za-z0-9_-]{20,}/g,
   /xox[baprs]-[A-Za-z0-9-]{10,}/g,
   /[rs]k_(?:live|test)_[A-Za-z0-9]{20,}/g,
-  /eyJ[A-Za-z0-9_-]{10,}\.eyJ[A-Za-z0-9_-]{10,}\.[A-Za-z0-9_-]{6,}/g, // JWT
+  /eyJ[A-Za-z0-9_-]{10,}\.eyJ[A-Za-z0-9_-]\.[A-Za-z0-9_-]{6,}/g, // JWT
   /dg_[A-Za-z0-9]{30,}/g, // Deepgram
   /hf_[A-Za-z0-9]{30,}/g, // HuggingFace

[Survived] Regex
src/redact.mjs:27:3
   /xox[baprs]-[A-Za-z0-9-]{10,}/g,
   /[rs]k_(?:live|test)_[A-Za-z0-9]{20,}/g,
   /eyJ[A-Za-z0-9_-]{10,}\.eyJ[A-Za-z0-9_-]{10,}\.[A-Za-z0-9_-]{6,}/g, // JWT
-  /dg_[A-Za-z0-9]{30,}/g, // Deepgram
+  /dg_[^A-Za-z0-9]{30,}/g, // Deepgram
   /hf_[A-Za-z0-9]{30,}/g, // HuggingFace
   /pk_(?:live|test)_[A-Za-z0-9]{20,}/g,

[Survived] Regex
src/redact.mjs:28:3
   /[rs]k_(?:live|test)_[A-Za-z0-9]{20,}/g,
   /eyJ[A-Za-z0-9_-]{10,}\.eyJ[A-Za-z0-9_-]{10,}\.[A-Za-z0-9_-]{6,}/g, // JWT
   /dg_[A-Za-z0-9]{30,}/g, // Deepgram
-  /hf_[A-Za-z0-9]{30,}/g, // HuggingFace
+  /hf_[^A-Za-z0-9]{30,}/g, // HuggingFace
   /pk_(?:live|test)_[A-Za-z0-9]{20,}/g,
   /postgres(?:ql)?:\/\/[^:\s]+:[^@\s]+@/g, // conn-string password

[Survived] Regex
src/redact.mjs:29:3
   /eyJ[A-Za-z0-9_-]{10,}\.eyJ[A-Za-z0-9_-]{10,}\.[A-Za-z0-9_-]{6,}/g, // JWT
   /dg_[A-Za-z0-9]{30,}/g, // Deepgram
   /hf_[A-Za-z0-9]{30,}/g, // HuggingFace
-  /pk_(?:live|test)_[A-Za-z0-9]{20,}/g,
+  /pk_(?:live|test)_[A-Za-z0-9]/g,
   /postgres(?:ql)?:\/\/[^:\s]+:[^@\s]+@/g, // conn-string password
   /mysql:\/\/[^:\s]+:[^@\s]+@/g,

[Killed] Regex
src/redact.mjs:30:3
   /dg_[A-Za-z0-9]{30,}/g, // Deepgram
   /hf_[A-Za-z0-9]{30,}/g, // HuggingFace
   /pk_(?:live|test)_[A-Za-z0-9]{20,}/g,
-  /postgres(?:ql)?:\/\/[^:\s]+:[^@\s]+@/g, // conn-string password
+  /postgres(?:ql)?:\/\/[:\s]+:[^@\s]+@/g, // conn-string password
   /mysql:\/\/[^:\s]+:[^@\s]+@/g,
   /mongodb(?:\+srv)?:\/\/[^:\s]+:[^@\s]+@/g,
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 86.730506
  type: 'test'

[Survived] Regex
src/redact.mjs:31:3
   /hf_[A-Za-z0-9]{30,}/g, // HuggingFace
   /pk_(?:live|test)_[A-Za-z0-9]{20,}/g,
   /postgres(?:ql)?:\/\/[^:\s]+:[^@\s]+@/g, // conn-string password
-  /mysql:\/\/[^:\s]+:[^@\s]+@/g,
+  /mysql:\/\/[:\s]+:[^@\s]+@/g,
   /mongodb(?:\+srv)?:\/\/[^:\s]+:[^@\s]+@/g,
   /redis:\/\/[^:\s]*:[^@\s]+@/g,

[Survived] Regex
src/redact.mjs:31:3
   /hf_[A-Za-z0-9]{30,}/g, // HuggingFace
   /pk_(?:live|test)_[A-Za-z0-9]{20,}/g,
   /postgres(?:ql)?:\/\/[^:\s]+:[^@\s]+@/g, // conn-string password
-  /mysql:\/\/[^:\s]+:[^@\s]+@/g,
+  /mysql:\/\/[^:\s]+:[^@\S]+@/g,
   /mongodb(?:\+srv)?:\/\/[^:\s]+:[^@\s]+@/g,
   /redis:\/\/[^:\s]*:[^@\s]+@/g,

[Survived] Regex
src/redact.mjs:32:3
   /pk_(?:live|test)_[A-Za-z0-9]{20,}/g,
   /postgres(?:ql)?:\/\/[^:\s]+:[^@\s]+@/g, // conn-string password
   /mysql:\/\/[^:\s]+:[^@\s]+@/g,
-  /mongodb(?:\+srv)?:\/\/[^:\s]+:[^@\s]+@/g,
+  /mongodb(?:\+srv)?:\/\/[^:\s]+:[^@\S]+@/g,
   /redis:\/\/[^:\s]*:[^@\s]+@/g,
   /0x[a-fA-F0-9]{64}\b/g, // 32-byte hex (eth private keys etc.)

[Survived] Regex
src/redact.mjs:32:3
   /pk_(?:live|test)_[A-Za-z0-9]{20,}/g,
   /postgres(?:ql)?:\/\/[^:\s]+:[^@\s]+@/g, // conn-string password
   /mysql:\/\/[^:\s]+:[^@\s]+@/g,
-  /mongodb(?:\+srv)?:\/\/[^:\s]+:[^@\s]+@/g,
+  /mongodb(?:\+srv):\/\/[^:\s]+:[^@\s]+@/g,
   /redis:\/\/[^:\s]*:[^@\s]+@/g,
   /0x[a-fA-F0-9]{64}\b/g, // 32-byte hex (eth private keys etc.)

[Survived] Regex
src/redact.mjs:33:3
   /postgres(?:ql)?:\/\/[^:\s]+:[^@\s]+@/g, // conn-string password
   /mysql:\/\/[^:\s]+:[^@\s]+@/g,
   /mongodb(?:\+srv)?:\/\/[^:\s]+:[^@\s]+@/g,
-  /redis:\/\/[^:\s]*:[^@\s]+@/g,
+  /redis:\/\/[^:\s]*:[^@\s]@/g,
   /0x[a-fA-F0-9]{64}\b/g, // 32-byte hex (eth private keys etc.)
   // RFC1918 addresses. Not a credential, but an internal host is infrastructure

[Survived] Regex
src/redact.mjs:33:3
   /postgres(?:ql)?:\/\/[^:\s]+:[^@\s]+@/g, // conn-string password
   /mysql:\/\/[^:\s]+:[^@\s]+@/g,
   /mongodb(?:\+srv)?:\/\/[^:\s]+:[^@\s]+@/g,
-  /redis:\/\/[^:\s]*:[^@\s]+@/g,
+  /redis:\/\/[^:\s]*:[@\s]+@/g,
   /0x[a-fA-F0-9]{64}\b/g, // 32-byte hex (eth private keys etc.)
   // RFC1918 addresses. Not a credential, but an internal host is infrastructure

[Killed] Regex
src/redact.mjs:34:3
   /mysql:\/\/[^:\s]+:[^@\s]+@/g,
   /mongodb(?:\+srv)?:\/\/[^:\s]+:[^@\s]+@/g,
   /redis:\/\/[^:\s]*:[^@\s]+@/g,
-  /0x[a-fA-F0-9]{64}\b/g, // 32-byte hex (eth private keys etc.)
+  /0x[a-fA-F0-9]\b/g, // 32-byte hex (eth private keys etc.)
   // RFC1918 addresses. Not a credential, but an internal host is infrastructure
   // detail about someone's network, and a wrapped is a thing people post. Found
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 122.317448
  type: 'test'

[Killed] Regex
src/redact.mjs:34:3
   /mysql:\/\/[^:\s]+:[^@\s]+@/g,
   /mongodb(?:\+srv)?:\/\/[^:\s]+:[^@\s]+@/g,
   /redis:\/\/[^:\s]*:[^@\s]+@/g,
-  /0x[a-fA-F0-9]{64}\b/g, // 32-byte hex (eth private keys etc.)
+  /0x[^a-fA-F0-9]{64}\b/g, // 32-byte hex (eth private keys etc.)
   // RFC1918 addresses. Not a credential, but an internal host is infrastructure
   // detail about someone's network, and a wrapped is a thing people post. Found
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 81.850157

[Survived] Regex
src/redact.mjs:41:3
   // ssh <account>@)`, which survived every rule above because none describe an
   // IP. Private ranges only: a public address is indistinguishable from a
   // version string or an ordinary number, and matching those would redact prose.
-  /\b(?:10\.\d{1,3}|192\.168|172\.(?:1[6-9]|2\d|3[01]))\.\d{1,3}\.\d{1,3}\b/g,
+  /\b(?:10\.\d{1,3}|192\.168|172\.(?:1[6-9]|2\D|3[01]))\.\d{1,3}\.\d{1,3}\b/g,
 ];
 

[Killed] Regex
src/redact.mjs:50:3
 
 // ENV-style: SOMETHING_KEY=longvalue, SOMETHING_TOKEN=..., SOMETHING_SECRET=...
 const ENV_SECRET =
-  /\b([A-Z][A-Z0-9_]*(?:KEY|TOKEN|SECRET|PASSWORD|PASSWD|CREDENTIALS?|AUTH))=(["']?)([^\s"']{8,})\2/g;
+  /\b([A-Z][A-Z0-9_]*(?:KEY|TOKEN|SECRET|PASSWORD|PASSWD|CREDENTIALS?|AUTH))=(["']?)([\s"']{8,})\2/g;
 
 export function redactSecrets(text) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 68.877821

[Killed] Regex
src/redact.mjs:50:3
 
 // ENV-style: SOMETHING_KEY=longvalue, SOMETHING_TOKEN=..., SOMETHING_SECRET=...
 const ENV_SECRET =
-  /\b([A-Z][A-Z0-9_]*(?:KEY|TOKEN|SECRET|PASSWORD|PASSWD|CREDENTIALS?|AUTH))=(["']?)([^\s"']{8,})\2/g;
+  /\b([A-Z][A-Z0-9_](?:KEY|TOKEN|SECRET|PASSWORD|PASSWD|CREDENTIALS?|AUTH))=(["']?)([^\s"']{8,})\2/g;
 
 export function redactSecrets(text) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 115.423809

[Killed] BlockStatement
src/redact.mjs:52:37
 const ENV_SECRET =
   /\b([A-Z][A-Z0-9_]*(?:KEY|TOKEN|SECRET|PASSWORD|PASSWD|CREDENTIALS?|AUTH))=(["']?)([^\s"']{8,})\2/g;
 
-export function redactSecrets(text) {
-  if (!text) return text;
-  let out = text;
-  for (const re of SECRET_PATTERNS) out = out.replace(re, REDACTED);
-  out = out.replace(LABELED_SECRET, (_m, label, sep) => `${label}${sep}${REDACTED}`);
-  out = out.replace(ENV_SECRET, (_m, name) => `${name}=${REDACTED}`);
-  return out;
-}
+export function redactSecrets(text) {}
 
 // ---- path masking ----------------------------------------------------------
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

not ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 71.099383

[Killed] BooleanLiteral
src/redact.mjs:53:7
   /\b([A-Z][A-Z0-9_]*(?:KEY|TOKEN|SECRET|PASSWORD|PASSWD|CREDENTIALS?|AUTH))=(["']?)([^\s"']{8,})\2/g;
 
 export function redactSecrets(text) {
-  if (!text) return text;
+  if (text) return text;
   let out = text;
   for (const re of SECRET_PATTERNS) out = out.replace(re, REDACTED);
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 37.019012

[Killed] ConditionalExpression
src/redact.mjs:53:7
   /\b([A-Z][A-Z0-9_]*(?:KEY|TOKEN|SECRET|PASSWORD|PASSWD|CREDENTIALS?|AUTH))=(["']?)([^\s"']{8,})\2/g;
 
 export function redactSecrets(text) {
-  if (!text) return text;
+  if (true) return text;
   let out = text;
   for (const re of SECRET_PATTERNS) out = out.replace(re, REDACTED);
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 61.245163

[Survived] ArrowFunction
src/redact.mjs:56:37
   if (!text) return text;
   let out = text;
   for (const re of SECRET_PATTERNS) out = out.replace(re, REDACTED);
-  out = out.replace(LABELED_SECRET, (_m, label, sep) => `${label}${sep}${REDACTED}`);
+  out = out.replace(LABELED_SECRET, () => undefined);
   out = out.replace(ENV_SECRET, (_m, name) => `${name}=${REDACTED}`);
   return out;

[Killed] ArrowFunction
src/redact.mjs:57:33
   let out = text;
   for (const re of SECRET_PATTERNS) out = out.replace(re, REDACTED);
   out = out.replace(LABELED_SECRET, (_m, label, sep) => `${label}${sep}${REDACTED}`);
-  out = out.replace(ENV_SECRET, (_m, name) => `${name}=${REDACTED}`);
+  out = out.replace(ENV_SECRET, () => undefined);
   return out;
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 71.690339

[Survived] StringLiteral
src/redact.mjs:63:12
 
 // ---- path masking ----------------------------------------------------------
 const HOME = homedir();
-let USER = "";
+let USER = "Stryker was here!";
 try {
   USER = userInfo().username;

[Killed] BlockStatement
src/redact.mjs:64:5
 // ---- path masking ----------------------------------------------------------
 const HOME = homedir();
 let USER = "";
-try {
-  USER = userInfo().username;
-} catch {
+try {} catch {
   USER = process.env.USER || "";
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 88.34758
  type: 'test'
  ...

[Survived] BlockStatement
src/redact.mjs:66:9
 let USER = "";
 try {
   USER = userInfo().username;
-} catch {
-  USER = process.env.USER || "";
-}
+} catch {}
 
 // A username shorter than this is not masked outside an explicit /user/ path:

[Survived] ConditionalExpression
src/redact.mjs:67:10
 try {
   USER = userInfo().username;
 } catch {
-  USER = process.env.USER || "";
+  USER = false;
 }
 

[Survived] ConditionalExpression
src/redact.mjs:67:10
 try {
   USER = userInfo().username;
 } catch {
-  USER = process.env.USER || "";
+  USER = true;
 }
 

[Killed] BlockStatement
src/redact.mjs:94:29
 // word becomes [user] in report text. For a tool whose whole claim is that it
 // does not write your identity into files people sync, that is the right way to
 // be wrong.
-export function maskPath(p) {
-  if (!p || typeof p !== "string") return p;
-  let out = p;
-  if (HOME) out = out.split(HOME).join("~");
-  if (USER) {
-    out = out.replace(
-      new RegExp(`/(?:Users|home)/${escapeRe(USER)}(?=/|$)`, "g"),
-      "~"
-    );
-    out = out.split(`/${USER}/`).join("/[user]/");
-    if (USER.length >= MIN_MASKABLE_USER_LEN)
-      out = out.replace(
-        new RegExp(`(?<![A-Za-z0-9])${escapeRe(USER)}(?![A-Za-z0-9])`, "g"),
-        "[user]"
-      );
-  }
-  return out;
-}
+export function maskPath(p) {}
 
 // Reduce a cwd to a masked project label: last two path segments under ~.
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

not ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 161.862957
  type: 'test'

[Killed] ConditionalExpression
src/redact.mjs:95:7
 // does not write your identity into files people sync, that is the right way to
 // be wrong.
 export function maskPath(p) {
-  if (!p || typeof p !== "string") return p;
+  if (true) return p;
   let out = p;
   if (HOME) out = out.split(HOME).join("~");
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 85.730102

[Killed] EqualityOperator
src/redact.mjs:95:13
 // does not write your identity into files people sync, that is the right way to
 // be wrong.
 export function maskPath(p) {
-  if (!p || typeof p !== "string") return p;
+  if (!p || typeof p === "string") return p;
   let out = p;
   if (HOME) out = out.split(HOME).join("~");
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 85.316875

[Killed] ConditionalExpression
src/redact.mjs:97:7
 export function maskPath(p) {
   if (!p || typeof p !== "string") return p;
   let out = p;
-  if (HOME) out = out.split(HOME).join("~");
+  if (false) out = out.split(HOME).join("~");
   if (USER) {
     out = out.replace(
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 188.396921

[Survived] ConditionalExpression
src/redact.mjs:97:7
 export function maskPath(p) {
   if (!p || typeof p !== "string") return p;
   let out = p;
-  if (HOME) out = out.split(HOME).join("~");
+  if (true) out = out.split(HOME).join("~");
   if (USER) {
     out = out.replace(

[Killed] ConditionalExpression
src/redact.mjs:98:7
   if (!p || typeof p !== "string") return p;
   let out = p;
   if (HOME) out = out.split(HOME).join("~");
-  if (USER) {
+  if (false) {
     out = out.replace(
       new RegExp(`/(?:Users|home)/${escapeRe(USER)}(?=/|$)`, "g"),
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 88.572016
  type: 'test'
  ...

[Killed] BlockStatement
src/redact.mjs:98:13
   if (!p || typeof p !== "string") return p;
   let out = p;
   if (HOME) out = out.split(HOME).join("~");
-  if (USER) {
-    out = out.replace(
-      new RegExp(`/(?:Users|home)/${escapeRe(USER)}(?=/|$)`, "g"),
-      "~"
-    );
-    out = out.split(`/${USER}/`).join("/[user]/");
-    if (USER.length >= MIN_MASKABLE_USER_LEN)
-      out = out.replace(
-        new RegExp(`(?<![A-Za-z0-9])${escapeRe(USER)}(?![A-Za-z0-9])`, "g"),
-        "[user]"
-      );
-  }
+  if (USER) {}
   return out;
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 86.595614

[Killed] StringLiteral
src/redact.mjs:101:7
   if (USER) {
     out = out.replace(
       new RegExp(`/(?:Users|home)/${escapeRe(USER)}(?=/|$)`, "g"),
-      "~"
+      ""
     );
     out = out.split(`/${USER}/`).join("/[user]/");
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 90.078284

[Killed] ConditionalExpression
src/redact.mjs:104:9
       "~"
     );
     out = out.split(`/${USER}/`).join("/[user]/");
-    if (USER.length >= MIN_MASKABLE_USER_LEN)
+    if (false)
       out = out.replace(
         new RegExp(`(?<![A-Za-z0-9])${escapeRe(USER)}(?![A-Za-z0-9])`, "g"),
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 80.345352

[Killed] EqualityOperator
src/redact.mjs:104:9
       "~"
     );
     out = out.split(`/${USER}/`).join("/[user]/");
-    if (USER.length >= MIN_MASKABLE_USER_LEN)
+    if (USER.length < MIN_MASKABLE_USER_LEN)
       out = out.replace(
         new RegExp(`(?<![A-Za-z0-9])${escapeRe(USER)}(?![A-Za-z0-9])`, "g"),
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 61.024132

[Survived] StringLiteral
src/redact.mjs:106:72
     out = out.split(`/${USER}/`).join("/[user]/");
     if (USER.length >= MIN_MASKABLE_USER_LEN)
       out = out.replace(
-        new RegExp(`(?<![A-Za-z0-9])${escapeRe(USER)}(?![A-Za-z0-9])`, "g"),
+        new RegExp(`(?<![A-Za-z0-9])${escapeRe(USER)}(?![A-Za-z0-9])`, ""),
         "[user]"
       );

[Killed] BlockStatement
src/redact.mjs:134:35
 //      were written in full, and unescaped into title= attributes in the HTML.
 //      Splitting on both separators makes the two-segment rule mean the same
 //      thing on every platform, which is what it always claimed to mean.
-export function projectLabel(cwd) {
-  const masked = maskPath(redactSecrets(cwd));
-  if (!masked) return null;
-  const parts = masked.split(/[/\\]/).filter(Boolean);
-  if (parts.length <= 2) return masked;
-  return parts.slice(-2).join("/");
-}
+export function projectLabel(cwd) {}
 
 export function maskText(text) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 68.928637
  type: 'test'

[Killed] ConditionalExpression
src/redact.mjs:136:7
 //      thing on every platform, which is what it always claimed to mean.
 export function projectLabel(cwd) {
   const masked = maskPath(redactSecrets(cwd));
-  if (!masked) return null;
+  if (true) return null;
   const parts = masked.split(/[/\\]/).filter(Boolean);
   if (parts.length <= 2) return masked;
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 118.544305

[Killed] BooleanLiteral
src/redact.mjs:136:7
 //      thing on every platform, which is what it always claimed to mean.
 export function projectLabel(cwd) {
   const masked = maskPath(redactSecrets(cwd));
-  if (!masked) return null;
+  if (masked) return null;
   const parts = masked.split(/[/\\]/).filter(Boolean);
   if (parts.length <= 2) return masked;
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 71.461269

[Killed] MethodExpression
src/redact.mjs:137:17
 export function projectLabel(cwd) {
   const masked = maskPath(redactSecrets(cwd));
   if (!masked) return null;
-  const parts = masked.split(/[/\\]/).filter(Boolean);
+  const parts = masked.split(/[/\\]/);
   if (parts.length <= 2) return masked;
   return parts.slice(-2).join("/");
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 99.239602

[Killed] ConditionalExpression
src/redact.mjs:138:7
   const masked = maskPath(redactSecrets(cwd));
   if (!masked) return null;
   const parts = masked.split(/[/\\]/).filter(Boolean);
-  if (parts.length <= 2) return masked;
+  if (false) return masked;
   return parts.slice(-2).join("/");
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 81.493551
  type: 'test'

[Killed] ConditionalExpression
src/redact.mjs:138:7
   const masked = maskPath(redactSecrets(cwd));
   if (!masked) return null;
   const parts = masked.split(/[/\\]/).filter(Boolean);
-  if (parts.length <= 2) return masked;
+  if (true) return masked;
   return parts.slice(-2).join("/");
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 67.533944
  type: 'test'

[Killed] UnaryOperator
src/redact.mjs:139:22
   if (!masked) return null;
   const parts = masked.split(/[/\\]/).filter(Boolean);
   if (parts.length <= 2) return masked;
-  return parts.slice(-2).join("/");
+  return parts.slice(+2).join("/");
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 88.033093

[Killed] MethodExpression
src/redact.mjs:139:10
   if (!masked) return null;
   const parts = masked.split(/[/\\]/).filter(Boolean);
   if (parts.length <= 2) return masked;
-  return parts.slice(-2).join("/");
+  return parts.join("/");
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 105.343765

[Killed] BlockStatement
src/redact.mjs:142:32
   return parts.slice(-2).join("/");
 }
 
-export function maskText(text) {
-  if (!text) return text;
-  let out = redactSecrets(text);
-  out = maskPath(out);
-  return out;
-}
+export function maskText(text) {}
 
 // ---- identity pseudonymisation ---------------------------------------------
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 70.87593

[Killed] ConditionalExpression
src/redact.mjs:143:7
 }
 
 export function maskText(text) {
-  if (!text) return text;
+  if (true) return text;
   let out = redactSecrets(text);
   out = maskPath(out);
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 79.116561

[Killed] BooleanLiteral
src/redact.mjs:143:7
 }
 
 export function maskText(text) {
-  if (!text) return text;
+  if (text) return text;
   let out = redactSecrets(text);
   out = maskPath(out);
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 75.635565
  type: 'test'
  ...

[Killed] BlockStatement
src/redact.mjs:171:44
 // not anonymity. Raw identities are available on purpose via --show-accounts.
 const PSEUDONYM_SALT = "starreckon-account-v1:";
 
-export function accountPseudonym(identity) {
-  return (
-    "acct-" +
-    createHash("sha256")
-      .update(PSEUDONYM_SALT + String(identity ?? ""))
-      .digest("hex")
-      .slice(0, 8)
-  );
-}
+export function accountPseudonym(identity) {}
 
 // ---- project pseudonymisation (--no-projects) -------------------------------
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

not ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 64.237773

[Killed] StringLiteral
src/redact.mjs:173:5
 
 export function accountPseudonym(identity) {
   return (
-    "acct-" +
+    "" +
     createHash("sha256")
       .update(PSEUDONYM_SALT + String(identity ?? ""))
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 93.963126

[Killed] MethodExpression
src/redact.mjs:174:5
 export function accountPseudonym(identity) {
   return (
     "acct-" +
-    createHash("sha256")
-      .update(PSEUDONYM_SALT + String(identity ?? ""))
-      .digest("hex")
-      .slice(0, 8)
+    createHash("sha256").update(PSEUDONYM_SALT + String(identity ?? "")).digest("hex")
   );
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 58.183531

[Killed] LogicalOperator
src/redact.mjs:175:39
   return (
     "acct-" +
     createHash("sha256")
-      .update(PSEUDONYM_SALT + String(identity ?? ""))
+      .update(PSEUDONYM_SALT + String(identity && ""))
       .digest("hex")
       .slice(0, 8)
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

not ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 110.927261
  type: 'test'
