[Killed] ArithmeticOperator
src/redact.mjs:175:15
   return (
     "acct-" +
     createHash("sha256")
-      .update(PSEUDONYM_SALT + String(identity ?? ""))
+      .update(PSEUDONYM_SALT - String(identity ?? ""))
       .digest("hex")
       .slice(0, 8)
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

not ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 27.63524

[Killed] BlockStatement
src/redact.mjs:195:41
 // the label is a GROUPING KEY — per-project counts must survive it.
 const PROJECT_SALT = "starreckon-project-v1:";
 
-export function projectPseudonym(label) {
-  return (
-    "proj-" +
-    createHash("sha256")
-      .update(PROJECT_SALT + String(label ?? ""))
-      .digest("hex")
-      .slice(0, 8)
-  );
-}
+export function projectPseudonym(label) {}
 
 // Strings that are already anonymous: the exclusion sentinel and anything else
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 76.801972

[Killed] MethodExpression
src/redact.mjs:198:5
 export function projectPseudonym(label) {
   return (
     "proj-" +
-    createHash("sha256")
-      .update(PROJECT_SALT + String(label ?? ""))
-      .digest("hex")
-      .slice(0, 8)
+    createHash("sha256").update(PROJECT_SALT + String(label ?? "")).digest("hex")
   );
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 302.082762

[Killed] StringLiteral
src/redact.mjs:198:16
 export function projectPseudonym(label) {
   return (
     "proj-" +
-    createHash("sha256")
+    createHash("")
       .update(PROJECT_SALT + String(label ?? ""))
       .digest("hex")
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 490.634592
  type: 'test'

[Killed] ArithmeticOperator
src/redact.mjs:199:15
   return (
     "proj-" +
     createHash("sha256")
-      .update(PROJECT_SALT + String(label ?? ""))
+      .update(PROJECT_SALT - String(label ?? ""))
       .digest("hex")
       .slice(0, 8)
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 72.595217

[Survived] LogicalOperator
src/redact.mjs:199:37
   return (
     "proj-" +
     createHash("sha256")
-      .update(PROJECT_SALT + String(label ?? ""))
+      .update(PROJECT_SALT + String(label && ""))
       .digest("hex")
       .slice(0, 8)

[Killed] ArrowFunction
src/redact.mjs:208:20
 // Strings that are already anonymous: the exclusion sentinel and anything else
 // bracketed by the masking layer. Hashing them would only make output harder to
 // read for no gain.
-const isSentinel = (s) => s.startsWith("[") && s.endsWith("]");
+const isSentinel = () => undefined;
 
 // Collect every project label in a structure, then replace all of them.
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 84.650516
  type: 'test'
  ...

[Killed] ConditionalExpression
src/redact.mjs:208:27
 // Strings that are already anonymous: the exclusion sentinel and anything else
 // bracketed by the masking layer. Hashing them would only make output harder to
 // read for no gain.
-const isSentinel = (s) => s.startsWith("[") && s.endsWith("]");
+const isSentinel = (s) => false;
 
 // Collect every project label in a structure, then replace all of them.
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 47.953218
  type: 'test'
  ...

[Killed] BlockStatement
src/redact.mjs:219:84
 // replaced under EVERY shape, or the same project stays readable in the other
 // place. Collect-then-replace makes that automatic and makes the result
 // checkable: the caller can assert no collected label survives.
-export function collectProjectLabels(node, out = new Set(), key = null, depth = 0) {
-  if (depth > 20) return out;
-  if (typeof node === "string") {
-    if (key === "project" && node && !isSentinel(node)) out.add(node);
-    return out;
-  }
-  if (Array.isArray(node)) {
-    for (const v of node) collectProjectLabels(v, out, key, depth + 1);
-    return out;
-  }
-  if (node && typeof node === "object") {
-    for (const [k, v] of Object.entries(node)) {
-      // projects: [{ name, ... }] — the name IS the label
-      if ((k === "projects" || k === "top_projects") && Array.isArray(v)) {
-        for (const item of v)
-          if (item && typeof item.name === "string" && !isSentinel(item.name))
-            out.add(item.name);
-      }
-      collectProjectLabels(v, out, k, depth + 1);
-    }
-  }
-  return out;
-}
+export function collectProjectLabels(node, out = new Set(), key = null, depth = 0) {}
 
 // Returns a COPY with every collected label replaced by its pseudonym. The
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 64.234411
  type: 'test'
  ...

[Killed] ConditionalExpression
src/redact.mjs:220:7
 // place. Collect-then-replace makes that automatic and makes the result
 // checkable: the caller can assert no collected label survives.
 export function collectProjectLabels(node, out = new Set(), key = null, depth = 0) {
-  if (depth > 20) return out;
+  if (true) return out;
   if (typeof node === "string") {
     if (key === "project" && node && !isSentinel(node)) out.add(node);
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 80.157626
  type: 'test'
  ...

[Killed] EqualityOperator
src/redact.mjs:220:7
 // place. Collect-then-replace makes that automatic and makes the result
 // checkable: the caller can assert no collected label survives.
 export function collectProjectLabels(node, out = new Set(), key = null, depth = 0) {
-  if (depth > 20) return out;
+  if (depth <= 20) return out;
   if (typeof node === "string") {
     if (key === "project" && node && !isSentinel(node)) out.add(node);
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 43.334545

[Killed] BlockStatement
src/redact.mjs:221:33
 // checkable: the caller can assert no collected label survives.
 export function collectProjectLabels(node, out = new Set(), key = null, depth = 0) {
   if (depth > 20) return out;
-  if (typeof node === "string") {
-    if (key === "project" && node && !isSentinel(node)) out.add(node);
-    return out;
-  }
+  if (typeof node === "string") {}
   if (Array.isArray(node)) {
     for (const v of node) collectProjectLabels(v, out, key, depth + 1);
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 55.295099
  type: 'test'

[Killed] EqualityOperator
src/redact.mjs:221:7
 // checkable: the caller can assert no collected label survives.
 export function collectProjectLabels(node, out = new Set(), key = null, depth = 0) {
   if (depth > 20) return out;
-  if (typeof node === "string") {
+  if (typeof node !== "string") {
     if (key === "project" && node && !isSentinel(node)) out.add(node);
     return out;
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 95.279818

[Killed] LogicalOperator
src/redact.mjs:222:9
 export function collectProjectLabels(node, out = new Set(), key = null, depth = 0) {
   if (depth > 20) return out;
   if (typeof node === "string") {
-    if (key === "project" && node && !isSentinel(node)) out.add(node);
+    if (key === "project" || node && !isSentinel(node)) out.add(node);
     return out;
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 80.025892
  type: 'test'
  ...

[Killed] LogicalOperator
src/redact.mjs:222:9
 export function collectProjectLabels(node, out = new Set(), key = null, depth = 0) {
   if (depth > 20) return out;
   if (typeof node === "string") {
-    if (key === "project" && node && !isSentinel(node)) out.add(node);
+    if (key === "project" && node || !isSentinel(node)) out.add(node);
     return out;
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 57.584574

[Killed] ConditionalExpression
src/redact.mjs:225:7
     if (key === "project" && node && !isSentinel(node)) out.add(node);
     return out;
   }
-  if (Array.isArray(node)) {
+  if (true) {
     for (const v of node) collectProjectLabels(v, out, key, depth + 1);
     return out;
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 71.512258

[Survived] BlockStatement
src/redact.mjs:225:28
     if (key === "project" && node && !isSentinel(node)) out.add(node);
     return out;
   }
-  if (Array.isArray(node)) {
-    for (const v of node) collectProjectLabels(v, out, key, depth + 1);
-    return out;
-  }
+  if (Array.isArray(node)) {}
   if (node && typeof node === "object") {
     for (const [k, v] of Object.entries(node)) {

[Survived] ArithmeticOperator
src/redact.mjs:226:61
     return out;
   }
   if (Array.isArray(node)) {
-    for (const v of node) collectProjectLabels(v, out, key, depth + 1);
+    for (const v of node) collectProjectLabels(v, out, key, depth - 1);
     return out;
   }

[Killed] LogicalOperator
src/redact.mjs:229:7
     for (const v of node) collectProjectLabels(v, out, key, depth + 1);
     return out;
   }
-  if (node && typeof node === "object") {
+  if (node || typeof node === "object") {
     for (const [k, v] of Object.entries(node)) {
       // projects: [{ name, ... }] — the name IS the label
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 164.544546
  type: 'test'

[Killed] ConditionalExpression
src/redact.mjs:229:7
     for (const v of node) collectProjectLabels(v, out, key, depth + 1);
     return out;
   }
-  if (node && typeof node === "object") {
+  if (true) {
     for (const [k, v] of Object.entries(node)) {
       // projects: [{ name, ... }] — the name IS the label
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 63.212925

[Killed] BlockStatement
src/redact.mjs:230:48
     return out;
   }
   if (node && typeof node === "object") {
-    for (const [k, v] of Object.entries(node)) {
-      // projects: [{ name, ... }] — the name IS the label
-      if ((k === "projects" || k === "top_projects") && Array.isArray(v)) {
-        for (const item of v)
-          if (item && typeof item.name === "string" && !isSentinel(item.name))
-            out.add(item.name);
-      }
-      collectProjectLabels(v, out, k, depth + 1);
-    }
+    for (const [k, v] of Object.entries(node)) {}
   }
   return out;
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 67.74339
  type: 'test'
  ...

[Killed] ConditionalExpression
src/redact.mjs:232:32
   if (node && typeof node === "object") {
     for (const [k, v] of Object.entries(node)) {
       // projects: [{ name, ... }] — the name IS the label
-      if ((k === "projects" || k === "top_projects") && Array.isArray(v)) {
+      if ((k === "projects" || false) && Array.isArray(v)) {
         for (const item of v)
           if (item && typeof item.name === "string" && !isSentinel(item.name))
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 93.372887
  type: 'test'

[Killed] LogicalOperator
src/redact.mjs:232:12
   if (node && typeof node === "object") {
     for (const [k, v] of Object.entries(node)) {
       // projects: [{ name, ... }] — the name IS the label
-      if ((k === "projects" || k === "top_projects") && Array.isArray(v)) {
+      if ((k === "projects" && k === "top_projects") && Array.isArray(v)) {
         for (const item of v)
           if (item && typeof item.name === "string" && !isSentinel(item.name))
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 64.874788

[Killed] ConditionalExpression
src/redact.mjs:234:15
       // projects: [{ name, ... }] — the name IS the label
       if ((k === "projects" || k === "top_projects") && Array.isArray(v)) {
         for (const item of v)
-          if (item && typeof item.name === "string" && !isSentinel(item.name))
+          if (false)
             out.add(item.name);
       }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 63.836024
  type: 'test'

[Killed] EqualityOperator
src/redact.mjs:234:23
       // projects: [{ name, ... }] — the name IS the label
       if ((k === "projects" || k === "top_projects") && Array.isArray(v)) {
         for (const item of v)
-          if (item && typeof item.name === "string" && !isSentinel(item.name))
+          if (item && typeof item.name !== "string" && !isSentinel(item.name))
             out.add(item.name);
       }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 100.700534
  type: 'test'

[Killed] CallExpression
src/redact.mjs:235:13
       if ((k === "projects" || k === "top_projects") && Array.isArray(v)) {
         for (const item of v)
           if (item && typeof item.name === "string" && !isSentinel(item.name))
-            out.add(item.name);
+            ;
       }
       collectProjectLabels(v, out, k, depth + 1);
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 76.784481
  type: 'test'
  ...

[Survived] ArithmeticOperator
src/redact.mjs:237:39
           if (item && typeof item.name === "string" && !isSentinel(item.name))
             out.add(item.name);
       }
-      collectProjectLabels(v, out, k, depth + 1);
+      collectProjectLabels(v, out, k, depth - 1);
     }
   }

[Killed] BlockStatement
src/redact.mjs:247:62
 // input is never mutated: the terminal has already printed the real names by
 // the time this runs, and a shared object being rewritten under it would be a
 // bug waiting to happen.
-export function maskProjects(node, labels = null, depth = 0) {
-  const set = labels ?? collectProjectLabels(node);
-  const walk = (n, d) => {
-    if (d > 20) return n;
-    if (typeof n === "string") return set.has(n) ? projectPseudonym(n) : n;
-    if (Array.isArray(n)) return n.map((v) => walk(v, d + 1));
-    if (n && typeof n === "object") {
-      const out = {};
-      for (const [k, v] of Object.entries(n)) out[k] = walk(v, d + 1);
-      return out;
-    }
-    return n;
-  };
-  return walk(node, depth);
-}
+export function maskProjects(node, labels = null, depth = 0) {}
 
 // Email addresses in free text. Kept as a source string (not a shared /g
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 101.712416
  type: 'test'
  ...

[Killed] LogicalOperator
src/redact.mjs:248:15
 // the time this runs, and a shared object being rewritten under it would be a
 // bug waiting to happen.
 export function maskProjects(node, labels = null, depth = 0) {
-  const set = labels ?? collectProjectLabels(node);
+  const set = labels && collectProjectLabels(node);
   const walk = (n, d) => {
     if (d > 20) return n;
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 98.690374

[Killed] BlockStatement
src/redact.mjs:249:26
 // bug waiting to happen.
 export function maskProjects(node, labels = null, depth = 0) {
   const set = labels ?? collectProjectLabels(node);
-  const walk = (n, d) => {
-    if (d > 20) return n;
-    if (typeof n === "string") return set.has(n) ? projectPseudonym(n) : n;
-    if (Array.isArray(n)) return n.map((v) => walk(v, d + 1));
-    if (n && typeof n === "object") {
-      const out = {};
-      for (const [k, v] of Object.entries(n)) out[k] = walk(v, d + 1);
-      return out;
-    }
-    return n;
-  };
+  const walk = (n, d) => {};
   return walk(node, depth);
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 93.72917
  type: 'test'
  ...

[Killed] EqualityOperator
src/redact.mjs:250:9
 export function maskProjects(node, labels = null, depth = 0) {
   const set = labels ?? collectProjectLabels(node);
   const walk = (n, d) => {
-    if (d > 20) return n;
+    if (d <= 20) return n;
     if (typeof n === "string") return set.has(n) ? projectPseudonym(n) : n;
     if (Array.isArray(n)) return n.map((v) => walk(v, d + 1));
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 64.958056

[Killed] ConditionalExpression
src/redact.mjs:250:9
 export function maskProjects(node, labels = null, depth = 0) {
   const set = labels ?? collectProjectLabels(node);
   const walk = (n, d) => {
-    if (d > 20) return n;
+    if (true) return n;
     if (typeof n === "string") return set.has(n) ? projectPseudonym(n) : n;
     if (Array.isArray(n)) return n.map((v) => walk(v, d + 1));
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 114.609428
  type: 'test'

[Killed] ConditionalExpression
src/redact.mjs:251:9
   const set = labels ?? collectProjectLabels(node);
   const walk = (n, d) => {
     if (d > 20) return n;
-    if (typeof n === "string") return set.has(n) ? projectPseudonym(n) : n;
+    if (true) return set.has(n) ? projectPseudonym(n) : n;
     if (Array.isArray(n)) return n.map((v) => walk(v, d + 1));
     if (n && typeof n === "object") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 101.547061
  type: 'test'
  ...

[Killed] EqualityOperator
src/redact.mjs:251:9
   const set = labels ?? collectProjectLabels(node);
   const walk = (n, d) => {
     if (d > 20) return n;
-    if (typeof n === "string") return set.has(n) ? projectPseudonym(n) : n;
+    if (typeof n !== "string") return set.has(n) ? projectPseudonym(n) : n;
     if (Array.isArray(n)) return n.map((v) => walk(v, d + 1));
     if (n && typeof n === "object") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 66.241502

[Killed] ConditionalExpression
src/redact.mjs:252:9
   const walk = (n, d) => {
     if (d > 20) return n;
     if (typeof n === "string") return set.has(n) ? projectPseudonym(n) : n;
-    if (Array.isArray(n)) return n.map((v) => walk(v, d + 1));
+    if (true) return n.map((v) => walk(v, d + 1));
     if (n && typeof n === "object") {
       const out = {};
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 83.746375

[Killed] ConditionalExpression
src/redact.mjs:252:9
   const walk = (n, d) => {
     if (d > 20) return n;
     if (typeof n === "string") return set.has(n) ? projectPseudonym(n) : n;
-    if (Array.isArray(n)) return n.map((v) => walk(v, d + 1));
+    if (false) return n.map((v) => walk(v, d + 1));
     if (n && typeof n === "object") {
       const out = {};
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 62.961283

[Killed] ConditionalExpression
src/redact.mjs:253:14
     if (d > 20) return n;
     if (typeof n === "string") return set.has(n) ? projectPseudonym(n) : n;
     if (Array.isArray(n)) return n.map((v) => walk(v, d + 1));
-    if (n && typeof n === "object") {
+    if (n && true) {
       const out = {};
       for (const [k, v] of Object.entries(n)) out[k] = walk(v, d + 1);
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 78.567348

[Killed] LogicalOperator
src/redact.mjs:253:9
     if (d > 20) return n;
     if (typeof n === "string") return set.has(n) ? projectPseudonym(n) : n;
     if (Array.isArray(n)) return n.map((v) => walk(v, d + 1));
-    if (n && typeof n === "object") {
+    if (n || typeof n === "object") {
       const out = {};
       for (const [k, v] of Object.entries(n)) out[k] = walk(v, d + 1);
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 79.429227
  type: 'test'

[Survived] ArithmeticOperator
src/redact.mjs:255:64
     if (Array.isArray(n)) return n.map((v) => walk(v, d + 1));
     if (n && typeof n === "object") {
       const out = {};
-      for (const [k, v] of Object.entries(n)) out[k] = walk(v, d + 1);
+      for (const [k, v] of Object.entries(n)) out[k] = walk(v, d - 1);
       return out;
     }

[Killed] StringLiteral
src/redact.mjs:266:3
 // Email addresses in free text. Kept as a source string (not a shared /g
 // RegExp object) so no caller can be bitten by a stale lastIndex.
 const EMAIL_SRC =
-  "[A-Za-z0-9._%+-]+@[A-Za-z0-9](?:[A-Za-z0-9-]*[A-Za-z0-9])?(?:\\.[A-Za-z0-9](?:[A-Za-z0-9-]*[A-Za-z0-9])?)*\\.[A-Za-z]{2,}";
+  "";
 
 export function emailRe(flags = "g") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 73.324214
  type: 'test'
  ...

[Killed] BlockStatement
src/redact.mjs:268:38
 const EMAIL_SRC =
   "[A-Za-z0-9._%+-]+@[A-Za-z0-9](?:[A-Za-z0-9-]*[A-Za-z0-9])?(?:\\.[A-Za-z0-9](?:[A-Za-z0-9-]*[A-Za-z0-9])?)*\\.[A-Za-z]{2,}";
 
-export function emailRe(flags = "g") {
-  return new RegExp(EMAIL_SRC, flags);
-}
+export function emailRe(flags = "g") {}
 
 // First email-shaped string in `text`, with its offset — used by the verify
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 68.124291

[Killed] BlockStatement
src/redact.mjs:274:33
 
 // First email-shaped string in `text`, with its offset — used by the verify
 // output-scrub check to point at the exact line.
-export function findEmail(text) {
-  if (!text || typeof text !== "string") return null;
-  const m = emailRe().exec(text);
-  return m ? { value: m[0], index: m.index } : null;
-}
+export function findEmail(text) {}
 
 // Replace every email address in free text with its stable pseudonym.
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 108.360488

[Killed] EqualityOperator
src/redact.mjs:275:16
 // First email-shaped string in `text`, with its offset — used by the verify
 // output-scrub check to point at the exact line.
 export function findEmail(text) {
-  if (!text || typeof text !== "string") return null;
+  if (!text || typeof text === "string") return null;
   const m = emailRe().exec(text);
   return m ? { value: m[0], index: m.index } : null;
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 64.43552

[Killed] BooleanLiteral
src/redact.mjs:275:7
 // First email-shaped string in `text`, with its offset — used by the verify
 // output-scrub check to point at the exact line.
 export function findEmail(text) {
-  if (!text || typeof text !== "string") return null;
+  if (text || typeof text !== "string") return null;
   const m = emailRe().exec(text);
   return m ? { value: m[0], index: m.index } : null;
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 95.914721

[Killed] BlockStatement
src/redact.mjs:281:38
 }
 
 // Replace every email address in free text with its stable pseudonym.
-export function maskIdentities(text) {
-  if (!text || typeof text !== "string") return text;
-  return text.replace(emailRe(), (m) => accountPseudonym(m));
-}
+export function maskIdentities(text) {}
 
 function escapeRe(s) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 109.073476

[Killed] BooleanLiteral
src/redact.mjs:282:7
 
 // Replace every email address in free text with its stable pseudonym.
 export function maskIdentities(text) {
-  if (!text || typeof text !== "string") return text;
+  if (text || typeof text !== "string") return text;
   return text.replace(emailRe(), (m) => accountPseudonym(m));
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 118.989287

[Killed] ConditionalExpression
src/redact.mjs:282:7
 
 // Replace every email address in free text with its stable pseudonym.
 export function maskIdentities(text) {
-  if (!text || typeof text !== "string") return text;
+  if (true) return text;
   return text.replace(emailRe(), (m) => accountPseudonym(m));
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end
ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 72.542044
  type: 'test'
  ...

[Killed] ArrowFunction
src/redact.mjs:283:34
 // Replace every email address in free text with its stable pseudonym.
 export function maskIdentities(text) {
   if (!text || typeof text !== "string") return text;
-  return text.replace(emailRe(), (m) => accountPseudonym(m));
+  return text.replace(emailRe(), () => undefined);
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end
  ---
  duration_ms: 105.463579
  type: 'test'

[Killed] BlockStatement
src/redact.mjs:286:22
   return text.replace(emailRe(), (m) => accountPseudonym(m));
 }
 
-function escapeRe(s) {
-  return s.replace(/[.*+?^${}()|[\]\\]/g, "\\$&");
-}
+function escapeRe(s) {}
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 104.475318

[Killed] Regex
src/redact.mjs:287:20
 }
 
 function escapeRe(s) {
-  return s.replace(/[.*+?^${}()|[\]\\]/g, "\\$&");
+  return s.replace(/[^.*+?^${}()|[\]\\]/g, "\\$&");
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: discoverAccounts: full fixture end to end

ok 1 - discoverAccounts: full fixture end to end

  ---
  duration_ms: 69.553678

[Survived] StringLiteral
src/redact.mjs:287:43
 }
 
 function escapeRe(s) {
-  return s.replace(/[.*+?^${}()|[\]\\]/g, "\\$&");
+  return s.replace(/[.*+?^${}()|[\]\\]/g, "");
 }
 
